src/Catalogs/Промокоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Промокоды</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Владельцы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаПромокода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реферальный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыСотрудников</v8:Type>
						<v8:Type>cfg:CatalogRef.СегментыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/Промокоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Промокоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Промокод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Промокоды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СотрудникиСегмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СотрудникиСегмента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/КонтрагентыСегмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КонтрагентыСегмента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СтатусыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтатусыКонтрагентов</Name>
			<Comment>Статусы пациентов</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Потенциальный</Name>
					<Comment>Потенциальный клиент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Первичный</Name>
					<Comment>Новый пациент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВернувшийся</Name>
					<Comment>Невернувшийся пациент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Постоянный</Name>
					<Comment>Постоянный клиент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Промокоды/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьОтображениеЭлементов(ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(Объект.Сегмент) Тогда
		Объект.Сегмент = ПолучитьТипСегмента(Объект.Владельцы);
	КонецЕсли;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ Объект.ПометкаУдаления Тогда
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ЗаписатьНовыеПромокоды = Истина;
			
		ИначеЕсли ЗадаватьВопросОЗаписи Тогда
			ОписаниеОповещения	 = Новый ОписаниеОповещения("ПослеВопросаОЗаписи", ЭтотОбъект);
			ТекстВопроса		 = НСтр("ru = 'Промокоды будут сгенерированы заново,
			|старые промокоды будут удалены. Перезаписать?'");
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			
			Отказ = Истина;
			
		КонецЕсли;
	Иначе
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик асинхронного события.
//
Процедура ПослеВопросаОЗаписи(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ЗаписатьНовыеПромокоды = Истина;
		ЗадаватьВопросОЗаписи  = Ложь;
		
		Записать();
		Закрыть(); 
		
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		
		Модифицированность = Ложь;
		Закрыть();		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПередЗаписьюНаСервере".
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Промокоды.Наименование КАК Наименование,
	|	Промокоды.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Промокоды КАК Промокоды
	|ГДЕ
	|	Промокоды.Ссылка <> &Ссылка
	|	И Промокоды.Наименование = &Наименование");
	
	Запрос.УстановитьПараметр("Наименование", Объект.Наименование);
	Запрос.УстановитьПараметр("Ссылка"		, Объект.Ссылка);
	
	Отказ = Не Запрос.Выполнить().Пустой();
	Если Отказ Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Такой промокод уже существует!");
	КонецЕсли;  
	
	Если Объект.ПометкаУдаления Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ПромокодУдален", Истина);			
	КонецЕсли;

	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПослеЗаписиНаСервере".
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтотОбъект.УдалитьРеферальныеПромокоды = Истина Тогда
		УдалитьРеферальныеКодыКлиентов();
	КонецЕсли;

	Если ЗаписатьНовыеПромокоды Тогда
		ЗаписатьВРегистр();
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура РеферальныйКодПриИзменении(Элемент)
	
	ОбновитьОтображениеЭлементов(ЭтотОбъект);
	ЭтотОбъект.ЗадаватьВопросОЗаписи = Истина;
	
	Если Объект.Реферальный = Ложь Тогда
		ЭтотОбъект.УдалитьРеферальныеПромокоды = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура СегментРаспространителейПриИзменении(Элемент)
	
	ЭтотОбъект.ЗадаватьВопросОЗаписи = Истина;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ВладельцыПриИзменении(Элемент)
	
	Объект.Сегмент = ПолучитьТипСегмента(Объект.Владельцы);
	ЭтотОбъект.ЗадаватьВопросОЗаписи = Истина;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ДлинаПромокодаПриИзменении(Элемент)
	
	Если Объект.ДлинаПромокода > 20 Тогда
		Объект.ДлинаПромокода = 20;
	ИначеЕсли Объект.ДлинаПромокода < 5 Тогда
		Объект.ДлинаПромокода = 5;
	КонецЕсли;
	ЭтотОбъект.ЗадаватьВопросОЗаписи = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

&НаСервере
// Процедура, записывает в регистр сведений "Промокоды" записи по каждому контрагенту/сотруднику.
//
Процедура ЗаписатьРеферальныеКоды()
	
	МассивВладельцев = ПолучитьМассивРаспространителей(Объект.Владельцы, Объект.Сегмент);
	РегистрыСведений.Промокоды.СгенерироватьИЗаписатьПромокоды(Объект.ДлинаПромокода, Объект.Ссылка, МассивВладельцев);
	
КонецПроцедуры

&НаСервере
// Процедура, записывает в регистр сведений "Промокоды" запись по нереферальному промокоду.
//
Процедура ЗаписатьПромокод()
	
	НоваяЗапись			 = РегистрыСведений.Промокоды.СоздатьМенеджерЗаписи();
	НоваяЗапись.Активен	 = Истина;
	НоваяЗапись.Вид		 = Объект.Ссылка;
	НоваяЗапись.Промокод = Строка(Объект.Ссылка);
	НоваяЗапись.Записать();
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает массив распространителей реферального кода.
//
Функция ПолучитьМассивРаспространителей(Владельцы, Сегмент)
	
	Запрос = Новый Запрос;

	Если ЗначениеЗаполнено(Сегмент) Тогда
		
		Если Владельцы Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
							|	СотрудникиСегмента.Сотрудник КАК Ссылка
							|ИЗ
							|	РегистрСведений.СотрудникиСегмента КАК СотрудникиСегмента
							|ГДЕ
							|	СотрудникиСегмента.Сегмент = &Сегмент
							|	И НЕ СотрудникиСегмента.Сотрудник.ПометкаУдаления
							|	И НЕ СотрудникиСегмента.Сотрудник.ЭтоГруппа"
							
		Иначе 
			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	КонтрагентыСегмента.Контрагент КАК Ссылка
			               |ИЗ
			               |	РегистрСведений.КонтрагентыСегмента КАК КонтрагентыСегмента
			               |ГДЕ
			               |	КонтрагентыСегмента.Сегмент = &Сегмент
			               |	И НЕ КонтрагентыСегмента.Контрагент.ПометкаУдаления
			               |	И НЕ КонтрагентыСегмента.Контрагент.ЭтоГруппа"
						   
		КонецЕсли;
		
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Сегмент", Сегмент);
		
	ИначеЕсли Владельцы Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	НЕ Сотрудники.ПометкаУдаления
		|	И НЕ Сотрудники.ЭтоГруппа";

	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СтатусыКонтрагентов.Контрагент.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.СтатусыКонтрагентов КАК СтатусыКонтрагентов
		|ГДЕ
		|	НЕ СтатусыКонтрагентов.Контрагент.ПометкаУдаления
		|	И (СтатусыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Постоянный))";
		
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервере
// Процедура, производит запись в регистр в зависимости от типа промокода.
//
Процедура ЗаписатьВРегистр()
	
	Если Объект.Реферальный Тогда
		ЗаписатьРеферальныеКоды();
	Иначе
		ЗаписатьПромокод();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Процедура, обновляет видимость элементов.
//
Процедура ОбновитьОтображениеЭлементов(Форма)
	
	Форма.Элементы.ГруппаРеферальный.Видимость	= Форма.Объект.Реферальный;
	Форма.Элементы.КнопкаПромокоды.Видимость	= Форма.Объект.Реферальный;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Процедура, устанавливает тип значения сегмента распространителей.
//
Функция ПолучитьТипСегмента(ЭтоСотрудники)
	
	Если ЭтоСотрудники = Истина Тогда
		Возврат ПредопределенноеЗначение("Справочник.СегментыСотрудников.ПустаяСсылка");
	Иначе
		Возврат ПредопределенноеЗначение("Справочник.СегментыКонтрагентов.ПустаяСсылка");
	КонецЕсли;
	
КонецФункции

&НаСервере
// Процедура, удаляет реферальные коды клиентов.
//
Процедура УдалитьРеферальныеКодыКлиентов()
		
	НаборЗаписей = РегистрыСведений.Промокоды.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Вид.Установить(Объект.Ссылка);
	НаборЗаписей.Записать();

КонецПроцедуры

#КонецОбласти
